fonecmid-diplom/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_НачалоДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_ОкончаниеДействияДоговора</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_АбонентскаяПлата</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>12</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

fonecmid-diplom/src/CommonModules/ВКМ_РаботаСФормами/Module.bsl
#Область ПрограммныйИнтерфейс

Процедура ДополнитьФорму(Форма) Экспорт
	
	ИмяФормы = Форма.ИмяФормы;
		
	Если ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ВКМ_ФормаЭлемента" Тогда 
		ДобавитьГруппаПериодДействияДоговора(Форма);
		ДобавитьПолеНачалоДействияДоговораВГруппаПериодДействияДоговора(Форма);
		ДобавитьПолеОкончаниеДействияДоговораВГруппаПериодДействияДоговора(Форма);
		ДобавитьПолеАбонентскаяПлата(Форма);
		ДобавитьПолеСтоимостьЧасаРаботы(Форма);
	КонецЕсли;

КонецПроцедуры

#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьГруппаПериодДействияДоговора(Форма)
	
	ГруппаПериодДействияДоговора = Форма.Элементы.Вставить("ГруппаПериодДействияДоговора", Тип("ГруппаФормы"));
	ГруппаПериодДействияДоговора.Вид = ВидГруппыФормы.ОбычнаяГруппа;
	ГруппаПериодДействияДоговора.ОтображатьЗаголовок = Ложь;
	ГруппаПериодДействияДоговора.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяЕслиВозможно;
	
КонецПроцедуры

Процедура ДобавитьПолеНачалоДействияДоговораВГруппаПериодДействияДоговора(Форма)
	
	ПолеВвода = Форма.Элементы.Добавить("НачалоДействияДоговора", Тип("ПолеФормы"), Форма.Элементы.ГруппаПериодДействияДоговора);
	ПолеВвода.Подсказка = "Дата начала действия договора";
	ПолеВвода.Заголовок = "Период действия с";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_НачалоДействияДоговора";
	
КонецПроцедуры

Процедура ДобавитьПолеОкончаниеДействияДоговораВГруппаПериодДействияДоговора(Форма)
	
	ПолеВвода = Форма.Элементы.Добавить("ОкончаниеДействияДоговора", Тип("ПолеФормы"), Форма.Элементы.ГруппаПериодДействияДоговора);
	ПолеВвода.Подсказка = "Дата окончания действия договора";
	ПолеВвода.Заголовок = "по";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_ОкончаниеДействияДоговора";
	
КонецПроцедуры

Процедура ДобавитьПолеАбонентскаяПлата(Форма)
	
	ПолеВвода = Форма.Элементы.Вставить("АбонентскаяПлата", Тип("ПолеФормы"));
	ПолеВвода.Подсказка = "Сумма ежемесячной абоненсткой платы";
	ПолеВвода.Заголовок = "Абонентская плата";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_АбонентскаяПлата";
	
КонецПроцедуры

Процедура ДобавитьПолеСтоимостьЧасаРаботы(Форма)
	
	ПолеВвода = Форма.Элементы.Вставить("СтоимостьЧасаРаботы", Тип("ПолеФормы"));
	ПолеВвода.Подсказка = "Стоимость часа работы специалиста";
	ПолеВвода.Заголовок = "Стоимость часа работы";
	ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
	ПолеВвода.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
	
КонецПроцедуры


#КонецОбласти
